Revit 2026 API

# PanelScheduleViewCreateInstanceView(Document, ElementId) Method

---

Creates a new instance of this view (using default template)

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PanelScheduleView CreateInstanceView(
	Document ADoc,
	ElementId panelId
)
```
```vb
Public Shared Function CreateInstanceView (
	ADoc As Document,
	panelId As ElementId
) As PanelScheduleView
```
```cpp
public:
static PanelScheduleView^ CreateInstanceView(
	Document^ ADoc,
	ElementId^ panelId
)
```
```fsharp
static member CreateInstanceView :
        ADoc : Document *
        panelId : ElementId -> PanelScheduleView
```

#### Parameters

ADoc Document
     The Document
panelId ElementId
     Element id of the electrical panel element.

#### Return Value

PanelScheduleView The PanelScheduleView

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PanelScheduleView Class

CreateInstanceView Overload

Autodesk.Revit.DB.Electrical Namespace